from math import sqrt
from os import system

""" Варіант 29
    Для заданого натурального числа n обчислити """

sum = 0
n = int(input('Введіть кількість членів n: ')) # Введення кількості членів

if n < 1: # Перевірка кількості членів на натуральність
    print('Число n не може бути меншим за 1') 
    exit(0)

for i in range(n):
    sum = sqrt(2 + sum) # Обчислення проміжної суми
    print('sum = %.10f' % sum) # Виведення на екран проміжної суми

print('Результат: %.10f' % sum) # Виведення результату

system('pause')

