#include <stdio.h>
#include <math.h>

/* Варіант №29
   Обчислити відстань між двома точками з 
   координатами (x1, y1) і (x2, y2) */

int main()
{
	double x1, y1, x2, y2;	// Оголошення змінних, що міститимуть координати точок
	double distance;	// Оголошення змінної, що міститиме відстань між точками

	printf("x1 = ");	// Виведення запрошення в консоль до введення координати x1
	scanf_s("%lf", &x1);	// Введення координати x1

	printf("y1 = ");	// Виведення запрошення в консоль до введення координати x1
	scanf_s("%lf", &y1);	// Введення координати x1

	printf("x2 = ");	// Виведення запрошення в консоль до введення координати x1
	scanf_s("%lf", &x2);	// Введення координати x1

	printf("y2 = ");	// Виведення запрошення в консоль до введення координати x1
	scanf_s("%lf", &y2);	// Введення координати x1

	distance = sqrt(pow(x1 - x2, 2) + pow(y1 - y2, 2));	// Обчислення відстані між точками

	printf("distance = %f\n", distance);	// Виведення відстані між точками

	system("pause");	// Команда системі, щоб програма призупинилася до натискання клавіші й не закривалася
}


