import random

class Discipline:
    def __init__(
            self,
            name=None,
            number_of_hours=None
    ):
        if name is None:
            discipline_names = (
                "Комп'ютерна дискретна математика",
                "Математичний аналіз",
                "Лінійна алгебра та аналітична геометрія",
                "Українська мова за професійним спрямуванням",
                "Екологічна безпека та цивільний захист",
                "Історія науки і техніки",
                "Основи здорового способу життя",
                "Іноземна мова",
                "Теорія ймовірностей",
                "Групова динаміка та комунікації",
                "Філософські основи наукового пізнання",
                "Права і свободи людини",
                "Економіка IT - індустрії та підприємництво",
                "Іноземна мова професійного спрямування",
                "Фізика",
                "Алгоритми та структури даних",
                "Основи програмування",
                "Основи компютерних систем і мереж",
                "Бази даних",
                "Курсова робота з баз даних",
                "Компоненти програмної інженерії",
                "Безпека програмного забезпечення",
                "Проектування алгоритмів",
                "Системне програмне забезпечення",
                "Програмування веб - застосувань",
                "Ймовірністні моделі та статистичне оцінювання в інформаційних системах",
                "Аналіз даних в інформаційних системах",
                "Курсова робота з аналізу даних в інформаційних системах",
                "Мультипарадигмене програмування",
                "Програмування інтернет речей",
                "Методи оптимізації та прийняття рішень",
                "Технології паралельних обчислень",
                "Програмування інтелектуальних інформаційних систем",
                "Моделювання систем",
                "Інформаційні системи та технології"
            )
            name = random.choice(discipline_names)

        if number_of_hours is None:
            number_of_hours = random.randint(2, 12)

        self.__name = name
        self.__number_of_hours = number_of_hours


    @property
    def number_of_hours(self):
        return self.__number_of_hours


    @property
    def name(self):
        return self.__name


    def __str__(self):
        return f'Назва дисципліни: {self.__name}\n' \
               f'Кількість годин: {self.__number_of_hours}'


    def __repr__(self):
        return self.__str__()
