"""
1 курс, 2 семестр, Основи програмування, лабораторна робота №5.

Варіант 29
Спроектувати клас "Особа", який містить ПІБ, дата народження і методи
визначення її віку та обчислення місячного заробітку. На основі цього класу
створити класи-нащадки "Студент", який містить додатково номер академічної
групи студента, середній рейтинговий бал за результатами останньої сесії,
статус отримання стипендії у новому семетрі (підвищена, звичайна, немає), та
"Викладач", який містить додатково назви дисциплін, які викладає даний
виклада, планову кількість годин, які повинен провести по кожній дисципліні,
за місяць. Створити n студентів і m викладачів. Для студентів розрахувати
розмір місячної стипендії (підвищена, якщо рейтинговий бал більше 95, і
звичайна - якщо середній рейтинговий бал більше 85, але менше 95), для
викладачів - місячну заробітну плату. Втзначити вік викладача, що має
найбільшу місячну заробітну плату.
"""
from Person import Person
from Functions import generate_students, generate_teachers, \
    get_teacher_with_highest_salary

if __name__ == '__main__':
    n = int(input('Скільки студентів згенерувати?: '))
    m = int(input('Скільки викладачів згенерувати?: '))

    students = generate_students(n)
    teachers = generate_teachers(m)

    print(f'\nЗгенеровані студенти:')
    print('\n\n'.join([str(student) for student in students]))

    print('\nЗгенеровані студенти:')
    print('\n'.join([str(teacher) for teacher in teachers]))

    teacher_with_highest_salary = get_teacher_with_highest_salary(teachers)

    print(
        'Викладач із найбільшою зарплатою:',
        teacher_with_highest_salary,
        sep='\n'
    )

    input()
