from os import system

""" Варіант 29
    Задані дійсні числа x, y. 
    Визначити, чи належить точка з координатами (x, y) 
    заштрихованій частині площини """

x = float(input('Введіть координату x: '))
y = float(input('Введіть координату y: '))

if abs(x) <= 1:
    if (y <= 1):
        if (abs(x) <= y):
            ans = 'Точка належить заштрихованій області'
        else:
            ans = 'Точка не належить заштрихованій області'
    else:
        ans = 'Точка не належить заштрихованій області'
else:
    ans = 'Точка не належить заштрихованій області'

print(ans)

system('pause')