#include "Discipline.h"

Discipline::Discipline()
{
	string rgDisciplinesNames[35]{
		"Комп'ютерна дискретна математика",
		"Математичний аналіз",
		"Лінійна алгебра та аналітична геометрія",
		"Українська мова за професійним спрямуванням",
		"Екологічна безпека та цивільний захист",
		"Історія науки і техніки",
		"Основи здорового способу життя",
		"Іноземна мова",
		"Теорія ймовірностей",
		"Групова динаміка та комунікації",
		"Філософські основи наукового пізнання",
		"Права і свободи людини",
		"Економіка IT - індустрії та підприємництво",
		"Іноземна мова професійного спрямування",
		"Фізика",
		"Алгоритми та структури даних",
		"Основи програмування",
		"Основи компютерних систем і мереж",
		"Бази даних",
		"Курсова робота з баз даних",
		"Компоненти програмної інженерії",
		"Безпека програмного забезпечення",
		"Проектування алгоритмів",
		"Системне програмне забезпечення",
		"Програмування веб - застосувань",
		"Ймовірністні моделі та статистичне оцінювання в інформаційних системах",
		"Аналіз даних в інформаційних системах",
		"Курсова робота з аналізу даних в інформаційних системах",
		"Мультипарадигмене програмування",
		"Програмування інтернет речей",
		"Методи оптимізації та прийняття рішень",
		"Технології паралельних обчислень",
		"Програмування інтелектуальних інформаційних систем",
		"Моделювання систем",
		"Інформаційні системи та технології"
	};

	m_sName = rgDisciplinesNames[rand() % 35];
	m_nNumberOfHours = 2 + rand() % 11;
}

ostream& operator << (ostream& os, const Discipline& a_discipline)
{
	return os << "Назва дисципліни: " << a_discipline.m_sName << endl
			<< "Кількість годин: " << a_discipline.m_nNumberOfHours;
}