/*
* 1 курс, 2 семестр, Основи програмування, лабораторна робота №5.
*
* Варіант 29
* Спроектувати клас "Особа", який містить ПІБ, дата народження і методи
* визначення її віку та обчислення місячного заробітку. На основі цього класу
* створити класи-нащадки "Студент", який містить додатково номер академічної
* групи студента, середній рейтинговий бал за результатами останньої сесії,
* статус отримання стипендії у новому семетрі (підвищена, звичайна, немає), та
* "Викладач", який містить додатково назви дисциплін, які викладає даний
* виклада, планову кількість годин, які повинен провести по кожній дисципліні,
* за місяць. Створити n студентів і m викладачів. Для студентів розрахувати
* розмір місячної стипендії (підвищена, якщо рейтинговий бал більше 95, і
* звичайна - якщо середній рейтинговий бал більше 85, але менше 95), для
* викладачів - місячну заробітну плату. Визначити вік викладача, що має
* найбільшу місячну заробітну плату.
*/
#include <locale>
#include <Windows.h>
#include "Functions.h"

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	locale::global(locale("rus_rus.1251"));

	srand(time(nullptr));

	size_t n, m;
	cout << "Скільки студентів згенерувати?: ";
	cin >> n;
	cout << "Скільки викладачів згенерувати?: ";
	cin >> m;

	Student* rgStudents = generateStudents(n);
	Teacher* rgTeachers = generateTeachers(m);

	cout << endl << "Згенеровані студенти:" << endl;
	outputStudents(rgStudents, n);
	cout << "Згенеровані викладачі:" << endl;
	outputTeachers(rgTeachers, m);

	Teacher teacherWithHighestSalary = getTeacherWithHighestSalary(rgTeachers, m);

	cout << "Викладач із найбільною зарплатою:" << endl << teacherWithHighestSalary << endl;

	system("pause");
	return 0;
}