#include "Person.h"
int Person::getAge() const
{
	TDate dtCurrent = TDate::getCurrentDate();

	int nYears;
	int aDaysInMonth[] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };

	nYears = dtCurrent.year - m_dtBirthday.year;

	if (dtCurrent.month < m_dtBirthday.month || (dtCurrent.month == m_dtBirthday.month && dtCurrent.day < m_dtBirthday.day))
	{
		--nYears;
	}

	return nYears;
}

Person::Person()
{
	string rgLastNames[31]{
		"Алєксєєв", "Боровков", "Веремчук", "Гіжицький",
		"Головатюк", "Головня", "Гуськов", "Демиденко",
		"Друзенко", "Дякунчак", "Звєрєв", "Калашніков",
		"Кашка", "Книш", "Кузьменков", "Куценко",
		"Лесів", "Лисенко", "Лошак", "Ляля", "Негрієнко",
		"Панченко", "Прищепа", "Рябов", "Савенко",
		"Сідак", "Тарасьнок", "Тихонов", "Трикош",
		"Шамков", "Ющенко"
	};

	string rgFirstNames[16]{
		"Андрій", "Іван", "Ігор", "Даніїл", "Владислав",
		"Олександр", "Кирило", "Олексій", "Микола",
		"Максим", "Дмитро", "Артемій", "Віктор",
		"Сергій", "Юрій", "Федір"
	};

	string rgPatronymics[20]{
		"Олександрович", "Ігорович", "Денисович",
		"Ростиславович", "Михайлович", "Олексійович",
		"Юрійович", "Віталійович", "Миколайович",
		"Євгенович", "Сергійович", "Олегович",
		"Ілліч", "Іванович", "Костянтинович",
		"Станіславович", "Андрійович",
		"Володимирович", "Дмитрович",
		"Вікторович"
	};

	m_sName = rgLastNames[rand() % 31] + ' ' + rgFirstNames[rand() % 16] + ' ' + rgPatronymics[rand() % 20];
	m_dtBirthday = TDate();
}